f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_b.h
//*****************************************************************************
//
//! \brief Stops the Timer_B
//!
//! \param baseAddress is the base address of the TIMER_B module.
//!
//! Modified bits of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_stop(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Sets the value of the capture-compare register
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param compareRegister selects the compare register being used. Refer to
//!        datasheet to ensure the device has the compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param compareValue is the count to be compared with in compare mode
//!
//! Modified bits of \b TBxCCRn register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_setCompareValue(uint16_t baseAddress,
                                    uint16_t compareRegister,
                                    uint16_t compareValue);

//*****************************************************************************
//
//! \brief Clears the Timer_B TBIFG interrupt flag
//!
//! \param baseAddress is the base address of the TIMER_B module.
//!
//! Modified bits are \b TBIFG of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_clearTimerInterruptFlag(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears the capture-compare interrupt flag
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param captureCompareRegister selects the capture compare register being
//!        used. Refer to datasheet to ensure the device has the capture
//!        compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!
//! Modified bits are \b CCIFG of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_clearCaptureCompareInterruptFlag(uint16_t baseAddress,
                                                     uint16_t captureCompareRegister);

//*****************************************************************************
//
//! \brief Selects Timer_B counter length
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param counterLength selects the value of counter length.
//!        Valid values are:
//!        - \b TIMER_B_COUNTER_16BIT [Default]
//!        - \b TIMER_B_COUNTER_12BIT
//!        - \b TIMER_B_COUNTER_10BIT
//!        - \b TIMER_B_COUNTER_8BIT
//!
//! Modified bits are \b CNTL of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_selectCounterLength(uint16_t baseAddress,
                                        uint16_t counterLength);

//*****************************************************************************
//
//! \brief Selects Timer_B Latching Group
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param groupLatch selects the latching group.
//!        Valid values are:
//!        - \b TIMER_B_GROUP_NONE [Default]
//!        - \b TIMER_B_GROUP_CL12_CL23_CL56
//!        - \b TIMER_B_GROUP_CL123_CL456
//!        - \b TIMER_B_GROUP_ALL
//!
//! Modified bits are \b TBCLGRP of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_selectLatchingGroup(uint16_t baseAddress,
                                        uint16_t groupLatch);

//*****************************************************************************
//
//! \brief Selects Compare Latch Load Event
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param compareRegister selects the compare register being used. Refer to
//!        datasheet to ensure the device has the compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param compareLatchLoadEvent selects the latch load event
//!        Valid values are:
//!        - \b TIMER_B_LATCH_ON_WRITE_TO_TBxCCRn_COMPARE_REGISTER [Default]
//!        - \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UP_OR_CONT_MODE
//!        - \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UPDOWN_MODE
//!        - \b
//!           TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_CURRENT_COMPARE_LATCH_VALUE
//!
//! Modified bits are \b CLLD of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_B_initCompareLatchLoadEvent(uint16_t baseAddress,
                                              uint16_t compareRegister,
                                              uint16_t compareLatchLoadEvent);

//*****************************************************************************
//
//! \brief Reads the current timer count value
//!
//! Reads the current count value of the timer. There is a majority vote system
//! in place to confirm an accurate value is returned. The Timer_B_THRESHOLD
//! #define in the associated header file can be modified so that the votes
//! must be closer together for a consensus to occur.
//!
//! \param baseAddress is the base address of the Timer module.
//!
//! \return Majority vote of timer count value
//
//*****************************************************************************
extern uint16_t Timer_B_getCounterValue(uint16_t baseAddress);

//*****************************************************************************
//
// The Timer_B_configureContinuousMode() API has been deprecated. Instead
// please use the Timer_B_initContinuousMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_configureContinuousMode(uint16_t baseAddress,
                                            uint16_t clockSource,
                                            uint16_t clockSourceDivider,
                                            uint16_t timerInterruptEnable_TBIE,
                                            uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_configureUpMode() API has been deprecated. Instead please use
// the Timer_B_initUpMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_configureUpMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TBIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_configureUpDownMode() API has been deprecated. Instead please
// use the Timer_B_initUpDownMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_configureUpDownMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerPeriod,
                                        uint16_t timerInterruptEnable_TBIE,
                                        uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                        uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_startContinuousMode() API has been deprecated. Instead please
// use the Timer_B_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_startContinuousMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerInterruptEnable_TBIE,
                                        uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_startContinousMode() API has been deprecated. Instead please use
// the Timer_B_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_startContinousMode(uint16_t baseAddress,
                                       uint16_t clockSource,
                                       uint16_t clockSourceDivider,
                                       uint16_t timerInterruptEnable_TBIE,
                                       uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_startUpMode() API has been deprecated. Instead please use the
// Timer_B_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_startUpMode(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t timerInterruptEnable_TBIE,
                                uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_startUpDownMode() API has been deprecated. Instead please use
// the Timer_B_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_startUpDownMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TBIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_B_initCapture() API has been deprecated. Instead please use the
// Timer_B_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_initCapture(uint16_t baseAddress,
                                uint16_t captureRegister,
                                uint16_t captureMode,
                                uint16_t captureInputSelect,
                                uint16_t synchronizeCaptureSource,
                                uint16_t captureInterruptEnable,
                                uint16_t captureOutputMode);
#endif

//*****************************************************************************
//
// The Timer_B_initCompare() API has been deprecated. Instead please use the
// Timer_B_initCompareMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_initCompare(uint16_t baseAddress,
                                uint16_t compareRegister,
                                uint16_t compareInterruptEnable,
                                uint16_t compareOutputMode,
                                uint16_t compareValue);
#endif

//*****************************************************************************
//
// The Timer_B_generatePWM() API has been deprecated. Instead please use the
// Timer_B_outputPWM() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_B_generatePWM(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t compareRegister,
                                uint16_t compareOutputMode,
                                uint16_t dutyCycle);
#endif

//*****************************************************************************
//
// The following are deprecated API names. These were updated to new names to
// add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define TIMER_B_startCounter                               Timer_B_startCounter
#define TIMER_B_initContinuousMode                   Timer_B_initContinuousMode
#define TIMER_B_configureContinuousMode         Timer_B_configureContinuousMode
#define TIMER_B_initUpMode                                   Timer_B_initUpMode
#define TIMER_B_configureUpMode                         Timer_B_configureUpMode
#define TIMER_B_initUpDownMode                           Timer_B_initUpDownMode
#define TIMER_B_configureUpDownMode                 Timer_B_configureUpDownMode
#define TIMER_B_startContinuousMode                 Timer_B_startContinuousMode
#define TIMER_B_startContinousMode                   Timer_B_startContinousMode
#define TIMER_B_startUpMode                                 Timer_B_startUpMode
#define TIMER_B_startUpDownMode                         Timer_B_startUpDownMode
#define TIMER_B_initCaptureMode                         Timer_B_initCaptureMode
#define TIMER_B_initCapture                                 Timer_B_initCapture
#define TIMER_B_initCompareMode                         Timer_B_initCompareMode
#define TIMER_B_initCompare                                 Timer_B_initCompare
#define TIMER_B_enableInterrupt                         Timer_B_enableInterrupt
#define TIMER_B_disableInterrupt                       Timer_B_disableInterrupt
#define TIMER_B_getInterruptStatus                   Timer_B_getInterruptStatus
#define TIMER_B_enableCaptureCompareInterrupt                                 \
    Timer_B_enableCaptureCompareInterrupt
#define TIMER_B_disableCaptureCompareInterrupt                                \
    Timer_B_disableCaptureCompareInterrupt
#define TIMER_B_getCaptureCompareInterruptStatus                              \
    Timer_B_getCaptureCompareInterruptStatus
#define TIMER_B_clear                                             Timer_B_clear
#define TIMER_B_getSynchronizedCaptureCompareInput                            \
    Timer_B_getSynchronizedCaptureCompareInput
#define TIMER_B_getOutputForOutputModeOutBitValue                             \
    Timer_B_getOutputForOutputModeOutBitValue
#define TIMER_B_getCaptureCompareCount           Timer_B_getCaptureCompareCount
#define TIMER_B_setOutputForOutputModeOutBitValue                             \
    Timer_B_setOutputForOutputModeOutBitValue
#define TIMER_B_outputPWM                                     Timer_B_outputPWM
#define TIMER_B_generatePWM                                 Timer_B_generatePWM
#define TIMER_B_stop                                               Timer_B_stop
#define TIMER_B_setCompareValue                         Timer_B_setCompareValue
#define TIMER_B_clearTimerInterruptFlag         Timer_B_clearTimerInterruptFlag
#define TIMER_B_clearCaptureCompareInterruptFlag                              \
    Timer_B_clearCaptureCompareInterruptFlag
#define TIMER_B_selectCounterLength                 Timer_B_selectCounterLength
#define TIMER_B_selectLatchingGroup                 Timer_B_selectLatchingGroup
#define TIMER_B_initCompareLatchLoadEvent     Timer_B_initCompareLatchLoadEvent
#define TIMER_B_getCounterValue                         Timer_B_getCounterValue
#endif

//*****************************************************************************
//
// The following are deprecated struct names. These were updated to new names
// to add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define TIMER_B_outputPWMParam                           Timer_B_outputPWMParam
#define TIMER_B_initUpModeParam                         Timer_B_initUpModeParam
#define TIMER_B_initCaptureModeParam               Timer_B_initCaptureModeParam
#define TIMER_B_initContinuousModeParam         Timer_B_initContinuousModeParam
#define TIMER_B_initUpDownModeParam                 Timer_B_initUpDownModeParam
#define TIMER_B_initCompareModeParam               Timer_B_initCompareModeParam
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_TIMER_B_H__
//Released_Version_4_20_00
